SAR-mango/SinESC/Old/Dev/Original ST Software/STSW-ESC001V1/ESC_STM32_FOC_FW/Web/MCLibrary/stm32f0xx_MisraCompliance.h
/********************  Bits definition for RTC_WPR register  ******************/
#define RTC_WPR_KEY                          ((uint32_t)0x000000FF)        /*!<  */

/********************  Bits definition for RTC_SSR register  ******************/
#define RTC_SSR_SS                           ((uint32_t)0x0003FFFF)        /*!<  */

/********************  Bits definition for RTC_SHIFTR register  ***************/
#define RTC_SHIFTR_SUBFS                     ((uint32_t)0x00007FFF)        /*!<  */
#define RTC_SHIFTR_ADD1S                     ((uint32_t)0x80000000)        /*!<  */

/********************  Bits definition for RTC_TSTR register  *****************/
#define RTC_TSTR_PM                          ((uint32_t)0x00400000)        /*!<  */
#define RTC_TSTR_HT                          ((uint32_t)0x00300000)        /*!<  */
#define RTC_TSTR_HT_0                        ((uint32_t)0x00100000)        /*!<  */
#define RTC_TSTR_HT_1                        ((uint32_t)0x00200000)        /*!<  */
#define RTC_TSTR_HU                          ((uint32_t)0x000F0000)        /*!<  */
#define RTC_TSTR_HU_0                        ((uint32_t)0x00010000)        /*!<  */
#define RTC_TSTR_HU_1                        ((uint32_t)0x00020000)        /*!<  */
#define RTC_TSTR_HU_2                        ((uint32_t)0x00040000)        /*!<  */
#define RTC_TSTR_HU_3                        ((uint32_t)0x00080000)        /*!<  */
#define RTC_TSTR_MNT                         ((uint32_t)0x00007000)        /*!<  */
#define RTC_TSTR_MNT_0                       ((uint32_t)0x00001000)        /*!<  */
#define RTC_TSTR_MNT_1                       ((uint32_t)0x00002000)        /*!<  */
#define RTC_TSTR_MNT_2                       ((uint32_t)0x00004000)        /*!<  */
#define RTC_TSTR_MNU                         ((uint32_t)0x00000F00)        /*!<  */
#define RTC_TSTR_MNU_0                       ((uint32_t)0x00000100)        /*!<  */
#define RTC_TSTR_MNU_1                       ((uint32_t)0x00000200)        /*!<  */
#define RTC_TSTR_MNU_2                       ((uint32_t)0x00000400)        /*!<  */
#define RTC_TSTR_MNU_3                       ((uint32_t)0x00000800)        /*!<  */
#define RTC_TSTR_ST                          ((uint32_t)0x00000070)        /*!<  */
#define RTC_TSTR_ST_0                        ((uint32_t)0x00000010)        /*!<  */
#define RTC_TSTR_ST_1                        ((uint32_t)0x00000020)        /*!<  */
#define RTC_TSTR_ST_2                        ((uint32_t)0x00000040)        /*!<  */
#define RTC_TSTR_SU                          ((uint32_t)0x0000000F)        /*!<  */
#define RTC_TSTR_SU_0                        ((uint32_t)0x00000001)        /*!<  */
#define RTC_TSTR_SU_1                        ((uint32_t)0x00000002)        /*!<  */
#define RTC_TSTR_SU_2                        ((uint32_t)0x00000004)        /*!<  */
#define RTC_TSTR_SU_3                        ((uint32_t)0x00000008)        /*!<  */

/********************  Bits definition for RTC_TSDR register  *****************/
#define RTC_TSDR_WDU                         ((uint32_t)0x0000E000)        /*!<  */
#define RTC_TSDR_WDU_0                       ((uint32_t)0x00002000)        /*!<  */
#define RTC_TSDR_WDU_1                       ((uint32_t)0x00004000)        /*!<  */
#define RTC_TSDR_WDU_2                       ((uint32_t)0x00008000)        /*!<  */
#define RTC_TSDR_MT                          ((uint32_t)0x00001000)        /*!<  */
#define RTC_TSDR_MU                          ((uint32_t)0x00000F00)        /*!<  */
#define RTC_TSDR_MU_0                        ((uint32_t)0x00000100)        /*!<  */
#define RTC_TSDR_MU_1                        ((uint32_t)0x00000200)        /*!<  */
#define RTC_TSDR_MU_2                        ((uint32_t)0x00000400)        /*!<  */
#define RTC_TSDR_MU_3                        ((uint32_t)0x00000800)        /*!<  */
#define RTC_TSDR_DT                          ((uint32_t)0x00000030)        /*!<  */
#define RTC_TSDR_DT_0                        ((uint32_t)0x00000010)        /*!<  */
#define RTC_TSDR_DT_1                        ((uint32_t)0x00000020)        /*!<  */
#define RTC_TSDR_DU                          ((uint32_t)0x0000000F)        /*!<  */
#define RTC_TSDR_DU_0                        ((uint32_t)0x00000001)        /*!<  */
#define RTC_TSDR_DU_1                        ((uint32_t)0x00000002)        /*!<  */
#define RTC_TSDR_DU_2                        ((uint32_t)0x00000004)        /*!<  */
#define RTC_TSDR_DU_3                        ((uint32_t)0x00000008)        /*!<  */

/********************  Bits definition for RTC_TSSSR register  ****************/
#define RTC_TSSSR_SS                         ((uint32_t)0x0003FFFF)

/********************  Bits definition for RTC_CAL register  *****************/
#define RTC_CAL_CALP                         ((uint32_t)0x00008000)        /*!<  */
#define RTC_CAL_CALW8                        ((uint32_t)0x00004000)        /*!<  */
#define RTC_CAL_CALW16                       ((uint32_t)0x00002000)        /*!<  */
#define RTC_CAL_CALM                         ((uint32_t)0x000001FF)        /*!<  */
#define RTC_CAL_CALM_0                       ((uint32_t)0x00000001)        /*!<  */
#define RTC_CAL_CALM_1                       ((uint32_t)0x00000002)        /*!<  */
#define RTC_CAL_CALM_2                       ((uint32_t)0x00000004)        /*!<  */
#define RTC_CAL_CALM_3                       ((uint32_t)0x00000008)        /*!<  */
#define RTC_CAL_CALM_4                       ((uint32_t)0x00000010)        /*!<  */
#define RTC_CAL_CALM_5                       ((uint32_t)0x00000020)        /*!<  */
#define RTC_CAL_CALM_6                       ((uint32_t)0x00000040)        /*!<  */
#define RTC_CAL_CALM_7                       ((uint32_t)0x00000080)        /*!<  */
#define RTC_CAL_CALM_8                       ((uint32_t)0x00000100)        /*!<  */

/********************  Bits definition for RTC_TAFCR register  ****************/
#define RTC_TAFCR_ALARMOUTTYPE               ((uint32_t)0x00040000)        /*!<  */
#define RTC_TAFCR_TAMPPUDIS                  ((uint32_t)0x00008000)        /*!<  */
#define RTC_TAFCR_TAMPPRCH                   ((uint32_t)0x00006000)        /*!<  */
#define RTC_TAFCR_TAMPPRCH_0                 ((uint32_t)0x00002000)        /*!<  */
#define RTC_TAFCR_TAMPPRCH_1                 ((uint32_t)0x00004000)        /*!<  */
#define RTC_TAFCR_TAMPFLT                    ((uint32_t)0x00001800)        /*!<  */
#define RTC_TAFCR_TAMPFLT_0                  ((uint32_t)0x00000800)        /*!<  */
#define RTC_TAFCR_TAMPFLT_1                  ((uint32_t)0x00001000)        /*!<  */
#define RTC_TAFCR_TAMPFREQ                   ((uint32_t)0x00000700)        /*!<  */
#define RTC_TAFCR_TAMPFREQ_0                 ((uint32_t)0x00000100)        /*!<  */
#define RTC_TAFCR_TAMPFREQ_1                 ((uint32_t)0x00000200)        /*!<  */
#define RTC_TAFCR_TAMPFREQ_2                 ((uint32_t)0x00000400)        /*!<  */
#define RTC_TAFCR_TAMPTS                     ((uint32_t)0x00000080)        /*!<  */
#define RTC_TAFCR_TAMP3EDGE                  ((uint32_t)0x00000040)        /*!<  */
#define RTC_TAFCR_TAMP3E                     ((uint32_t)0x00000020)        /*!<  */
#define RTC_TAFCR_TAMP2EDGE                  ((uint32_t)0x00000010)        /*!<  */
#define RTC_TAFCR_TAMP2E                     ((uint32_t)0x00000008)        /*!<  */
#define RTC_TAFCR_TAMPIE                     ((uint32_t)0x00000004)        /*!<  */
#define RTC_TAFCR_TAMP1TRG                   ((uint32_t)0x00000002)        /*!<  */
#define RTC_TAFCR_TAMP1E                     ((uint32_t)0x00000001)        /*!<  */

